# shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.aws_ssm_parameter.gcp_connectilly_web_credentials_client_id will be created
  + resource "aws_ssm_parameter" "gcp_connectilly_web_credentials_client_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gcp_connectilly_web_credentials_client_id"
      + tags           = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tags_all       = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.aws_ssm_parameter.gcp_connectilly_web_credentials_client_secret will be created
  + resource "aws_ssm_parameter" "gcp_connectilly_web_credentials_client_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gcp_connectilly_web_credentials_client_secret"
      + tags           = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tags_all       = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "cockroachdb_serverless_cluster_id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.cockroachdb_serverless_cluster.cockroach_cluster.default will be created
  + resource "cockroach_cluster" "default" {
      + account_id        = (known after apply)
      + cloud_provider    = "AWS"
      + cockroach_version = (known after apply)
      + creator_id        = (known after apply)
      + id                = (known after apply)
      + name              = "staging"
      + operation_status  = (known after apply)
      + plan              = (known after apply)
      + regions           = [
          + {
              + name       = "us-east-1"
              + node_count = (known after apply)
              + primary    = (known after apply)
              + sql_dns    = (known after apply)
              + ui_dns     = (known after apply)
            },
        ]
      + serverless        = {
          + routing_id  = (known after apply)
          + spend_limit = 0
        }
      + state             = (known after apply)
      + upgrade_status    = (known after apply)
    }

  # module.common_resources.module.cognito_user_pool.aws_cognito_identity_provider.google_provider will be created
  + resource "aws_cognito_identity_provider" "google_provider" {
      + attribute_mapping = {
          + "email"          = "email"
          + "email_verified" = "email_verified"
          + "family_name"    = "family_name"
          + "gender"         = "genders"
          + "given_name"     = "given_name"
          + "name"           = "names"
          + "phone_number"   = "phoneNumbers"
          + "picture"        = "picture"
          + "username"       = "sub"
        }
      + id                = (known after apply)
      + provider_details  = {
          + "authorize_scopes" = "email profile openid"
          + "client_id"        = "355630893502-rdkr61nhab8heu54329lp5l99cnjfnrq.apps.googleusercontent.com"
          + "client_secret"    = "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"
        }
      + provider_name     = "Google"
      + provider_type     = "Google"
      + user_pool_id      = (known after apply)
    }

  # module.common_resources.module.cognito_user_pool.aws_cognito_user_pool.default will be created
  + resource "aws_cognito_user_pool" "default" {
      + alias_attributes           = [
          + "email",
          + "preferred_username",
        ]
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "staging"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tags_all                   = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + email_configuration {
          + email_sending_account  = "DEVELOPER"
          + from_email_address     = "no-reply@staging-mail.connectilly.com"
          + reply_to_email_address = "no-reply@staging-mail.connectilly.com"
          + source_arn             = (known after apply)
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "sub"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + name                = "email"
          + required            = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + name                = "family_name"
          + required            = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + name                = "given_name"
          + required            = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "1"
            }
        }

      + user_attribute_update_settings {
          + attributes_require_verification_before_update = [
              + "email",
            ]
        }

      + username_configuration {
          + case_sensitive = false
        }
    }

  # module.common_resources.module.cognito_user_pool.aws_cognito_user_pool_domain.default will be created
  + resource "aws_cognito_user_pool_domain" "default" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "stagingconnectilly"
      + id                              = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # module.common_resources.module.cognito_user_pool.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "user_pool_id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.kafka_serverless_cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "upstash_kafka_cluster_id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.kafka_serverless_cluster.upstash_kafka_cluster.default will be created
  + resource "upstash_kafka_cluster" "default" {
      + cluster_id              = (known after apply)
      + cluster_name            = "staging"
      + creation_time           = (known after apply)
      + id                      = (known after apply)
      + max_message_size        = (known after apply)
      + max_messages_per_second = (known after apply)
      + max_partitions          = (known after apply)
      + max_retention_size      = (known after apply)
      + max_retention_time      = (known after apply)
      + multizone               = false
      + password                = (sensitive value)
      + region                  = "us-east-1"
      + rest_endpoint           = (known after apply)
      + state                   = (known after apply)
      + tcp_endpoint            = (known after apply)
      + type                    = (known after apply)
      + username                = (known after apply)
    }

  # module.common_resources.module.simple_email_service.aws_ses_domain_dkim.default will be created
  + resource "aws_ses_domain_dkim" "default" {
      + dkim_tokens = (known after apply)
      + domain      = "staging-mail.connectilly.com"
      + id          = (known after apply)
    }

  # module.common_resources.module.simple_email_service.aws_ses_domain_identity.default will be created
  + resource "aws_ses_domain_identity" "default" {
      + arn                = (known after apply)
      + domain             = "staging-mail.connectilly.com"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*